---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBarType.DeformationType
source: html/72c74a9f-1091-5ddb-69d6-93837af6bfee.htm
---
# Autodesk.Revit.DB.Structure.RebarBarType.DeformationType Property

Defines bar deformation type.

## Syntax (C#)
```csharp
public RebarDeformationType DeformationType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration